load_tests/server/artillery_photo.yml
config:
  target: "http://localhost:3010/sidebar/photos"
  phases:
    - duration: 20
      arrivalRate: 20
  payload:
    path: "businessIds_load_testing.csv"
    fields:
      - "id"
scenarios:
  - name: "Photos"
    flow:
      - loop:
        - get:
            url: "/{{ id }}"
        count: 200