load_tests/server/artillery_tip.yml
config:
  target: "http://localhost:3010/sidebar/businessTips"
  phases:
    - duration: 20
      arrivalRate: 10
  payload:
    path: "businessIds_load_testing.csv"
    fields:
      - "id"
scenarios:
  - name: "Business Tips"
    flow:
      - loop:
        - get:
            url: "/{{ id }}"
        count: 400